Repository: WWW4R4E/StarSorter
Catalog: winui/Resources/*/Resources.resw
Source language: en_us
Languages: zh_cn

# $Locale
source: en-US
zh_cn: zh-CN

# AppTitle
source: StarSorter
zh_cn: GitHub Stars 管理器

source: Stars
zh_cn: 收藏

source: Profile
zh_cn: 个人资料

source: Explore
zh_cn: 探索

source: Notifications
zh_cn: 通知

source: Settings
zh_cn: 设置

source: Appearance
zh_cn: 外观

# AppearanceDescription
source: Customize the look and feel of the app
zh_cn: 自定义应用的外观和感觉

source: Window Background
zh_cn: 窗口背景

# WindowBackgroundDescription
source: Choose the window background material
zh_cn: 选择窗口背景材质

source: App Theme
zh_cn: 应用主题

# AppThemeDescription
source: Choose your preferred app theme
zh_cn: 选择您喜欢的应用主题

source: Markdown Background
zh_cn: Markdown 背景

# MarkdownBackgroundDescription
source: Background color for markdown content (README, releases)
zh_cn: Markdown 内容的背景颜色（README、发布版本）

source: Navigation Pane Mode
zh_cn: 导航窗格模式

# NavigationPaneModeDescription
source: Choose the navigation pane display mode
zh_cn: 选择导航栏的显示模式

source: Language
zh_cn: 语言

# LanguageDescription
source: Choose application language
zh_cn: 选择应用语言

# GitHubDescription
source: Configure your GitHub API connection
zh_cn: 配置您的 GitHub API 连接

source: Personal Access Token
zh_cn: 个人访问令牌

# PersonalAccessTokenDescription
source: Enter your GitHub personal access token with repo & user scopes. Notifications only supports classic (personal access) tokens.
zh_cn: 输入您的 GitHub 个人访问令牌（需要 repo 和 user 权限）。通知功能仅支持 classic（个人访问）令牌。

source: Proxy
zh_cn: 代理

# ProxyDescription
source: Configure proxy for GitHub API requests
zh_cn: 为 GitHub API 请求配置代理

source: Proxy URL
zh_cn: 代理 URL

# ProxyUrlDescription
source: Enter your proxy server address
zh_cn: 输入您的代理服务器地址

source: Mica (Base)
zh_cn: 云母（基础）

source: Mica (Alt)
zh_cn: 云母（替代）

source: Acrylic (Base)
zh_cn: 亚克力（基础）

source: Acrylic (Thin)
zh_cn: 亚克力（轻薄）

source: None
zh_cn: 无

source: Light
zh_cn: 浅色

source: Dark
zh_cn: 深色

source: Use system setting
zh_cn: 使用系统设置

source: Dark Blue
zh_cn: 深蓝

source: Black
zh_cn: 黑色

source: Slate
zh_cn: 石板灰

source: Auto
zh_cn: 自动

source: Left
zh_cn: 左对齐

source: Left Compact
zh_cn: 左对齐(紧凑)

source: System Default
zh_cn: 系统默认

source: English
zh_cn: 英文

source: Save
zh_cn: 保存

source: Disabled
zh_cn: 不使用

source: System
zh_cn: 系统环境变量

source: Custom
zh_cn: 自定义

source: Token saved
zh_cn: 令牌已保存

source: Token not configured
zh_cn: 令牌未配置

source: Proxy disabled
zh_cn: 代理已禁用

source: Using system proxy
zh_cn: 使用系统代理

source: Using custom proxy
zh_cn: 使用自定义代理

# AutoMode
source: Auto
zh_cn: 自动

# ManualMode
source: Manual
zh_cn: 手动

source: Token saved successfully
zh_cn: 令牌保存成功

source: Token cannot be empty
zh_cn: 令牌不能为空

source: Proxy settings saved
zh_cn: 代理设置已保存

# LanguageChangedRestart
source: Language changed. Please restart the app for changes to take effect.
zh_cn: 语言已更改，请重启应用以生效。

source: Restart Required
zh_cn: 需要重启

source: Restart Now
zh_cn: 立即重启

source: Restart Later
zh_cn: 稍后重启

source: All Stars
zh_cn: 全部星星

source: Uncategorized
zh_cn: 未分类

source: All Notifications
zh_cn: 全部通知

source: Issue
zh_cn: 问题

source: Pull Request
zh_cn: 拉取请求

source: Release
zh_cn: 发布

source: Commit
zh_cn: 提交

source: Notification Category
zh_cn: 通知分类

source: Add Category
zh_cn: 新建

# MultiSelect
source: Multi
zh_cn: 多选

source: Cancel
zh_cn: 取消

# CancelMultiSelect
source: Cancel Multi
zh_cn: 取消多选

source: Smart Classify
zh_cn: 智能分类

source: Export Data
zh_cn: 导出数据

source: Import Result
zh_cn: 导入结果

# ConfirmExecute
source: Execute
zh_cn: 确认执行

# NoDataImported
source: No data imported yet
zh_cn: 尚未导入数据

# NoUncategorizedRepos
source: No uncategorized repositories
zh_cn: 没有未分类的仓库

# ExportedCount
source: Exported {0} repos to {1}
zh_cn: 已导出 {0} 个仓库到 {1}

# ImportedCount
source: Imported {0} repos, {1} categories
zh_cn: 已导入 {0} 个仓库，{1} 个分组

# Unassign
source: Unassigned
zh_cn: 未分配

# SummaryText
source: {0} categories, {1} repos
zh_cn: 共 {0} 个分类，{1} 个仓库

# SummaryWithUnassigned
source: {0} categories, {1} repos, {2} unassigned
zh_cn: 共 {0} 个分类，{1} 个仓库，{2} 个未分配

source: Remove from category
zh_cn: 从该分组移除

source: Unstar
zh_cn: 取消星标

source: Add to category
zh_cn: 添加到分组

source: Delete category
zh_cn: 删除分组

source: Reset category
zh_cn: 重置分组

source: Unstar Failed
zh_cn: 取消星标失败

# UnstarFailedContent
source: Some repositories failed to unstar. Please check your network and try again.
zh_cn: 部分仓库取消星标失败，请检查网络连接或稍后重试。

source: Import failed
zh_cn: 导入失败

source: OK
zh_cn: 确定

# CategoryNamePlaceholder
source: Enter category name
zh_cn: 输入分组名称

# AddCategoryDialogTitle
source: Add Category
zh_cn: 添加分组

# Notification_TimeAgo_JustNow
source: Just now
zh_cn: 刚刚

# Notification_TimeAgo_MinutesAgo
source: {0}m ago
zh_cn: {0} 分钟前

# Notification_TimeAgo_HoursAgo
source: {0}h ago
zh_cn: {0} 小时前

# Notification_TimeAgo_DaysAgo
source: {0}d ago
zh_cn: {0} 天前

# Notification_Reason_Mention
source: Mention
zh_cn: 提到了我

# Notification_Reason_Subscribed
source: Subscribed
zh_cn: 已订阅

# Notification_Reason_ReviewRequested
source: Review requested
zh_cn: 请求审核

# Notification_Reason_Assign
source: Assigned
zh_cn: 已分配

# Notification_Reason_StateChange
source: State changed
zh_cn: 状态变更

# Notification_Reason_SecurityAlert
source: Security alert
zh_cn: 安全警报

# Notification_Reason_CIActivity
source: CI activity
zh_cn: CI 活动

# Notification_Reason_Manual
source: Manual
zh_cn: 手动

# ProfileRepositories
source: Repositories
zh_cn: 仓库

# ProfileFollowers
source: Followers
zh_cn: 关注者

# ProfileFollowing
source: Following
zh_cn: 正在关注

# ProfileGists
source: Gists
zh_cn: 代码片段

# ProfileApiRateLimit
source: API Rate Limit
zh_cn: API 速率限制

# ProfileCoreApi
source: Core API
zh_cn: 核心 API

# ProfileSearchApi
source: Search API
zh_cn: 搜索 API

# LoadingStars
source: Loading starred repositories...
zh_cn: 正在加载收藏仓库...

source: Network Error
zh_cn: 网络错误

source: Request Failed
zh_cn: 请求失败

source: Retry
zh_cn: 重试

source: Permission Denied
zh_cn: 权限不足

# AuthFailed
source: Authentication Failed
zh_cn: 认证失败

# ErrorLoadStars
source: Failed to load starred repos: {0}
zh_cn: 加载收藏仓库失败: {0}

# GhNetworkError
source: Network error occurred
zh_cn: 发生网络错误

# GhUnauthorized
source: Unauthorized - check your token
zh_cn: 未授权 - 请检查您的令牌

# GhNotFound
source: Resource not found
zh_cn: 资源未找到

# GhRateLimited
source: Rate limited by GitHub API
zh_cn: GitHub API 速率限制

# GhServerError
source: GitHub server error
zh_cn: GitHub 服务器错误

# GhParseError
source: Failed to parse API response
zh_cn: 解析 API 响应失败

# GhForbidden
source: Access forbidden - token lacks required permissions
zh_cn: 访问被拒绝 - 令牌缺少所需权限

# GhHttpError
source: HTTP request failed with unexpected status
zh_cn: HTTP 请求失败，状态码异常

# GhUnknownError
source: Unknown error (code {0})
zh_cn: 未知错误 (代码 {0})

# ServerResponse
source: Server response: {0}
zh_cn: 服务器响应: {0}

source: Refresh
zh_cn: 刷新

# MarkAllRead
source: Mark all as read
zh_cn: 全部标为已读

# ErrorLoadProfile
source: Failed to load profile: {0}
zh_cn: 加载个人资料失败: {0}

# InvalidRepoName
source: Invalid repository name format.
zh_cn: 仓库名称格式无效

# ErrorLoadRepoDetails
source: Failed to load repository details: {0}
zh_cn: 加载仓库详情失败: {0}

# LoadingRepoDetails
source: Loading repository details...
zh_cn: 正在加载仓库详情...

source: Open in Browser
zh_cn: 在浏览器中打开

source: About
zh_cn: 关于

# AboutDescription
source: Usage guide and project info
zh_cn: 使用指南与项目信息

# ClassicTokenNote
source: Notifications only supports classic (personal access) tokens. Fine-grained tokens are not supported for the notifications API.
zh_cn: 通知功能仅支持 classic（个人访问）令牌。Fine-grained 令牌不支持通知 API。

# ProjectRepo
source: View on GitHub
zh_cn: 在 GitHub 上查看

# CheckUpdates
source: Check for Updates
zh_cn: 检查更新
